Revit 2026 API

# IRevisionsOnSheetUIServerShowDialog Method

---

Shows dialog on managing RevisionsOnSheetUI.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
bool ShowDialog(
	RevisionsOnSheetUIServiceData data
)
```
```vb
Function ShowDialog (
	data As RevisionsOnSheetUIServiceData
) As Boolean
```
```cpp
bool ShowDialog(
	RevisionsOnSheetUIServiceData^ data
)
```
```fsharp
abstract ShowDialog :
        data : RevisionsOnSheetUIServiceData -> bool
```

#### Parameters

data RevisionsOnSheetUIServiceData
     The data on initializing the dialog as well as getting the result.

#### Return Value

Boolean Whether or not the dialog launches successfully

#### Reference

IRevisionsOnSheetUIServer Interface

Autodesk.Revit.UI Namespace